iSYSTEMLabs/winIDEAExampleWorkspaces/Atmel/SAML10/targetInit/SAML10_sfr.h
  uint8_t res1[8];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t ID:3;
      uint64_t reservedSpace0:5;
      uint64_t TERR:1;
      uint64_t TCMPL:1;
      uint64_t SUSP:1;
      uint64_t reservedSpace1:2;
      uint64_t FERR:1;
      uint64_t BUSY:1;
      uint64_t PEND:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DMAC_INTPEND;

  uint8_t res2[2];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHINT0:1;
      uint64_t CHINT1:1;
      uint64_t CHINT2:1;
      uint64_t CHINT3:1;
      uint64_t CHINT4:1;
      uint64_t CHINT5:1;
      uint64_t CHINT6:1;
      uint64_t CHINT7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC_INTSTATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BUSYCH0:1;
      uint64_t BUSYCH1:1;
      uint64_t BUSYCH2:1;
      uint64_t BUSYCH3:1;
      uint64_t BUSYCH4:1;
      uint64_t BUSYCH5:1;
      uint64_t BUSYCH6:1;
      uint64_t BUSYCH7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC_BUSYCH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PENDCH0:1;
      uint64_t PENDCH1:1;
      uint64_t PENDCH2:1;
      uint64_t PENDCH3:1;
      uint64_t PENDCH4:1;
      uint64_t PENDCH5:1;
      uint64_t PENDCH6:1;
      uint64_t PENDCH7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC_PENDCH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LVLEX0:1;
      uint64_t LVLEX1:1;
      uint64_t LVLEX2:1;
      uint64_t LVLEX3:1;
      uint64_t reservedSpace0:4;
      uint64_t ID:5;
      uint64_t reservedSpace1:2;
      uint64_t ABUSY:1;
      uint64_t BTCNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC_ACTIVE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BASEADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC_BASEADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WRBADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC_WRBADDR;

  uint8_t res3[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t ID:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DMAC_CHID;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SWRST:1;
      uint64_t ENABLE:1;
      uint64_t reservedSpace0:4;
      uint64_t RUNSTDBY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DMAC_CHCTRLA;

  uint8_t res4[3];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EVACT:3;
      uint64_t EVIE:1;
      uint64_t EVOE:1;
      uint64_t LVL:2;
      uint64_t reservedSpace0:1;
      uint64_t TRIGSRC:5;
      uint64_t reservedSpace1:9;
      uint64_t TRIGACT:2;
      uint64_t CMD:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC_CHCTRLB;

  uint8_t res5[4];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t TERR:1;
      uint64_t TCMPL:1;
      uint64_t SUSP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DMAC_CHINTENCLR;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t TERR:1;
      uint64_t TCMPL:1;
      uint64_t SUSP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DMAC_CHINTENSET;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t TERR:1;
      uint64_t TCMPL:1;
      uint64_t SUSP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DMAC_CHINTFLAG;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PEND:1;
      uint64_t BUSY:1;
      uint64_t FERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DMAC_CHSTATUS;

};

#define DMAC_2 (*(volatile struct DMAC_2_tag *) 0x41006000)

struct DSU_tag
{
  union
  {
    uint8_t R;
    struct
    {
      uint64_t SWRST:1;
      uint64_t reservedSpace0:1;
      uint64_t CRC:1;
      uint64_t MBIST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DSU_CTRL;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DONE:1;
      uint64_t CRSTEXT:1;
      uint64_t BERR:1;
      uint64_t FAIL:1;
      uint64_t PERR:1;
      uint64_t BREXT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DSU_STATUSA;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DAL:2;
      uint64_t DBGPRES:1;
      uint64_t HPE:1;
      uint64_t DCCD0:1;
      uint64_t DCCD1:1;
      uint64_t BCCD0:1;
      uint64_t BCCD1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DSU_STATUSB;

  uint8_t DSU_STATUSC;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t AMOD:2;
      uint64_t ADDR:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSU_ADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t LENGTH:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSU_LENGTH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSU_DATA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSU_DCC_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSU_DCC_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DEVSEL:8;
      uint64_t REVISION:4;
      uint64_t DIE:4;
      uint64_t SERIES:6;
      uint64_t reservedSpace0:1;
      uint64_t FAMILY:5;
      uint64_t PROCESSOR:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSU_DID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LQOS:2;
      uint64_t DCCDMALEVEL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSU_CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSU_BCC_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSU_BCC_1;

  uint8_t res0[200];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCFG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSU_DCFG_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCFG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSU_DCFG_1;

