iSYSTEMLabs/winIDEAExampleWorkspaces/Atmel/SAML10/targetInit/SAML10_sfr.h
};

#define OSCCTRL (*(volatile struct OSCCTRL_tag *) 0x40001000)

struct OSC32KCTRL_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t XOSC32KRDY:1;
      uint64_t reservedSpace0:1;
      uint64_t CLKFAIL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OSC32KCTRL_INTENCLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XOSC32KRDY:1;
      uint64_t reservedSpace0:1;
      uint64_t CLKFAIL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OSC32KCTRL_INTENSET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XOSC32KRDY:1;
      uint64_t reservedSpace0:1;
      uint64_t CLKFAIL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OSC32KCTRL_INTFLAG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XOSC32KRDY:1;
      uint64_t reservedSpace0:1;
      uint64_t CLKFAIL:1;
      uint64_t CLKSW:1;
      uint64_t ULP32KSW:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OSC32KCTRL_STATUS;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RTCSEL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) OSC32KCTRL_RTCCTRL;

  uint8_t res0[3];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t ENABLE:1;
      uint64_t XTALEN:1;
      uint64_t EN32K:1;
      uint64_t EN1K:1;
      uint64_t reservedSpace1:1;
      uint64_t RUNSTDBY:1;
      uint64_t ONDEMAND:1;
      uint64_t STARTUP:3;
      uint64_t reservedSpace2:1;
      uint64_t WRTLOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) OSC32KCTRL_XOSC32K;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CFDEN:1;
      uint64_t SWBACK:1;
      uint64_t CFDPRESC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) OSC32KCTRL_CFDCTRL;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CFDEO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) OSC32KCTRL_EVCTRL;

  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t ULP32KSW:1;
      uint64_t reservedSpace1:2;
      uint64_t CALIB:5;
      uint64_t reservedSpace2:2;
      uint64_t WRTLOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OSC32KCTRL_OSCULP32K;

};

#define OSC32KCTRL (*(volatile struct OSC32KCTRL_tag *) 0x40001400)

struct PAC_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PERID:16;
      uint64_t KEY:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAC_WRCTRL;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t ERREO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PAC_EVCTRL;

  uint8_t res0[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t ERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PAC_INTENCLR;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t ERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PAC_INTENSET;

  uint8_t res1[6];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLASH:1;
      uint64_t HPB0:1;
      uint64_t HPB1:1;
      uint64_t HPB2:1;
      uint64_t HSRAMCPU:1;
      uint64_t HSRAMDMAC:1;
      uint64_t HSRAMDSU:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAC_INTFLAGAHB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PAC_bitfield:1;
      uint64_t PM_bitfield:1;
      uint64_t MCLK_bitfield:1;
      uint64_t RSTC:1;
      uint64_t OSCCTRL_bitfield:1;
      uint64_t OSC32KCTRL_bitfield:1;
      uint64_t SUPC:1;
      uint64_t GCLK_bitfield:1;
      uint64_t WDT:1;
      uint64_t RTC:1;
      uint64_t EIC_bitfield:1;
      uint64_t FREQM_bitfield:1;
      uint64_t PORT:1;
      uint64_t AC_bitfield:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAC_INTFLAGA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IDAU:1;
      uint64_t DSU_bitfield:1;
      uint64_t NVMCTRL_bitfield:1;
      uint64_t DMAC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAC_INTFLAGB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EVSYS_bitfield:1;
      uint64_t SERCOM0:1;
      uint64_t SERCOM1:1;
      uint64_t SERCOM2:1;
      uint64_t TC0:1;
      uint64_t TC1:1;
      uint64_t TC2:1;
      uint64_t ADC:1;
      uint64_t DAC_bitfield:1;
      uint64_t PTC:1;
      uint64_t TRNG:1;
      uint64_t CCL_bitfield:1;
      uint64_t OPAMP_bitfield:1;
      uint64_t TRAM_bitfield:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAC_INTFLAGC;

  uint8_t res2[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PAC_bitfield:1;
      uint64_t PM_bitfield:1;
      uint64_t MCLK_bitfield:1;
      uint64_t RSTC:1;
      uint64_t OSCCTRL_bitfield:1;
      uint64_t OSC32KCTRL_bitfield:1;
      uint64_t SUPC:1;
      uint64_t GCLK_bitfield:1;
      uint64_t WDT:1;
      uint64_t RTC:1;
      uint64_t EIC_bitfield:1;
      uint64_t FREQM_bitfield:1;
      uint64_t PORT:1;
      uint64_t AC_bitfield:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAC_STATUSA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IDAU:1;
      uint64_t DSU_bitfield:1;
      uint64_t NVMCTRL_bitfield:1;
      uint64_t DMAC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAC_STATUSB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EVSYS_bitfield:1;
      uint64_t SERCOM0:1;
      uint64_t SERCOM1:1;
      uint64_t SERCOM2:1;
      uint64_t TC0:1;
      uint64_t TC1:1;
      uint64_t TC2:1;
      uint64_t ADC:1;
      uint64_t DAC_bitfield:1;
      uint64_t PTC:1;
      uint64_t TRNG:1;
      uint64_t CCL_bitfield:1;
      uint64_t OPAMP_bitfield:1;
      uint64_t TRAM_bitfield:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAC_STATUSC;

  uint8_t res3[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PAC_bitfield:1;
      uint64_t PM_bitfield:1;
      uint64_t MCLK_bitfield:1;
      uint64_t RSTC:1;
      uint64_t OSCCTRL_bitfield:1;
      uint64_t OSC32KCTRL_bitfield:1;
      uint64_t SUPC:1;
      uint64_t GCLK_bitfield:1;
      uint64_t WDT:1;
      uint64_t RTC:1;
      uint64_t EIC_bitfield:1;
      uint64_t FREQM_bitfield:1;
      uint64_t PORT:1;
      uint64_t AC_bitfield:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAC_NONSECA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IDAU:1;
      uint64_t DSU_bitfield:1;
      uint64_t NVMCTRL_bitfield:1;
      uint64_t DMAC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAC_NONSECB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EVSYS_bitfield:1;
      uint64_t SERCOM0:1;
      uint64_t SERCOM1:1;
      uint64_t SERCOM2:1;
      uint64_t TC0:1;
      uint64_t TC1:1;
      uint64_t TC2:1;
      uint64_t ADC:1;
      uint64_t DAC_bitfield:1;
      uint64_t PTC:1;
      uint64_t TRNG:1;
      uint64_t CCL_bitfield:1;
      uint64_t OPAMP_bitfield:1;
      uint64_t TRAM_bitfield:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAC_NONSECC;

  uint8_t res4[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PAC_bitfield:1;
      uint64_t PM_bitfield:1;
      uint64_t MCLK_bitfield:1;
      uint64_t RSTC:1;
      uint64_t OSCCTRL_bitfield:1;
      uint64_t OSC32KCTRL_bitfield:1;
      uint64_t SUPC:1;
      uint64_t GCLK_bitfield:1;
      uint64_t WDT:1;
      uint64_t RTC:1;
      uint64_t EIC_bitfield:1;
      uint64_t FREQM_bitfield:1;
      uint64_t PORT:1;
      uint64_t AC_bitfield:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAC_SECLOCKA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IDAU:1;
      uint64_t DSU_bitfield:1;
      uint64_t NVMCTRL_bitfield:1;
      uint64_t DMAC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAC_SECLOCKB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EVSYS_bitfield:1;
      uint64_t SERCOM0:1;
      uint64_t SERCOM1:1;
      uint64_t SERCOM2:1;
      uint64_t TC0:1;
      uint64_t TC1:1;
      uint64_t TC2:1;
      uint64_t ADC:1;
      uint64_t DAC_bitfield:1;
      uint64_t PTC:1;
      uint64_t TRNG:1;
      uint64_t CCL_bitfield:1;
      uint64_t OPAMP_bitfield:1;
      uint64_t TRAM_bitfield:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAC_SECLOCKC;

