iSYSTEMLabs/winIDEAExampleWorkspaces/Atmel/SAML10/targetInit/SAML10_sfr.h
};

#define DIB_1 (*(volatile struct DIB_1_tag *) 0xe000efb0)

struct DWT_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CYCCNTENA:1;
      uint64_t POSTPRESET:4;
      uint64_t POSTINIT:4;
      uint64_t CYCTAP:1;
      uint64_t SYNCTAP:2;
      uint64_t PCSAMPLENA:1;
      uint64_t reservedSpace0:3;
      uint64_t EXCTRCENA:1;
      uint64_t CPIEVTENA:1;
      uint64_t EXCEVTENA:1;
      uint64_t SLEEPEVTENA:1;
      uint64_t LSUEVTENA:1;
      uint64_t FOLDEVTENA:1;
      uint64_t CYCEVTENA:1;
      uint64_t CYCDISS:1;
      uint64_t NOPRFCNT:1;
      uint64_t NOCYCCNT:1;
      uint64_t NOEXTTRIG:1;
      uint64_t NOTRCPKT:1;
      uint64_t NUMCOMP:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DWT_DWT_CTRL;

  uint8_t res0[24];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EIASAMPLE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DWT_DWT_PCSR;

  uint8_t res1[3984];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t KEY:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DWT_DWT_LAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SLI:1;
      uint64_t SLK:1;
      uint64_t nTT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DWT_DWT_LSR;

  uint8_t res2[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARCHPART:12;
      uint64_t ARCHVER:4;
      uint64_t REVISION:4;
      uint64_t PRESENT:1;
      uint64_t ARCHITECT:11;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DWT_DWT_DEVARCH;

  uint8_t res3[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAJOR:4;
      uint64_t SUB:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DWT_DWT_DEVTYPE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DES_2:4;
      uint64_t SIZE:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DWT_DWT_PIDR4;

  uint32_t DWT_DWT_PIDR5;
  uint32_t DWT_DWT_PIDR6;
  uint32_t DWT_DWT_PIDR7;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PART_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DWT_DWT_PIDR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PART_1:4;
      uint64_t DES_0:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DWT_DWT_PIDR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DES_1:3;
      uint64_t JEDEC:1;
      uint64_t REVISION:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DWT_DWT_PIDR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMOD:4;
      uint64_t REVAND:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DWT_DWT_PIDR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRMBL_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DWT_DWT_CIDR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRMBL_1:4;
      uint64_t CLASS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DWT_DWT_CIDR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRMBL_2:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DWT_DWT_CIDR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRMBL_3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DWT_DWT_CIDR3;

};

#define DWT (*(volatile struct DWT_tag *) 0xe0001000)

struct DWT_DWT_COMPARATOR_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DWT_DWT_COMP;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MATCH:4;
      uint64_t ACTION:2;
      uint64_t reservedSpace0:4;
      uint64_t DATAVSIZE:2;
      uint64_t reservedSpace1:12;
      uint64_t MATCHED:1;
      uint64_t reservedSpace2:2;
      uint64_t ID:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DWT_DWT_FUNCTION;

};

#define DWT_DWT_COMPARATOR_0 (*(volatile struct DWT_DWT_COMPARATOR_0_tag *) 0xe0001020)

struct DWT_DWT_COMPARATOR_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DWT_DWT_COMP;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MATCH:4;
      uint64_t ACTION:2;
      uint64_t reservedSpace0:4;
      uint64_t DATAVSIZE:2;
      uint64_t reservedSpace1:12;
      uint64_t MATCHED:1;
      uint64_t reservedSpace2:2;
      uint64_t ID:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DWT_DWT_FUNCTION;

};

#define DWT_DWT_COMPARATOR_1 (*(volatile struct DWT_DWT_COMPARATOR_1_tag *) 0xe0001030)

struct ICB_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTLINESNUM:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICB_ICTR;

  uint32_t ICB_ACTLR;
};

#define ICB_1 (*(volatile struct ICB_1_tag *) 0xe000e004)

struct MPU_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEPARATE:1;
      uint64_t reservedSpace0:7;
      uint64_t DREGION:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_MPU_TYPE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLE:1;
      uint64_t HFNMIENA:1;
      uint64_t PRIVDEFENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_MPU_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGION:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_MPU_RNR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XN:1;
      uint64_t AP:2;
      uint64_t SH:2;
      uint64_t BASE:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_MPU_RBAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t AttrInd:3;
      uint64_t reservedSpace0:1;
      uint64_t LIMIT:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_MPU_RLAR;

  uint8_t res0[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t Attr0:8;
      uint64_t Attr1:8;
      uint64_t Attr2:8;
      uint64_t Attr3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_MPU_MAIR0;

