iSYSTEMLabs/winIDEAExampleWorkspaces/Atmel/SAML10/targetInit/SAML10_sfr.h
  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t PRI_11:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCB_SHPR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI_12:8;
      uint64_t reservedSpace0:8;
      uint64_t PRI_14:8;
      uint64_t PRI_15:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCB_SHPR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t HARDFAULTACT:1;
      uint64_t reservedSpace1:2;
      uint64_t NMIACT:1;
      uint64_t reservedSpace2:1;
      uint64_t SVCALLACT:1;
      uint64_t reservedSpace3:2;
      uint64_t PENDSVACT:1;
      uint64_t SYSTICKACT:1;
      uint64_t reservedSpace4:3;
      uint64_t SVCALLPENDED:1;
      uint64_t reservedSpace5:5;
      uint64_t HARDFAULTPENDED:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCB_SHCSR;

  uint8_t res1[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HALTED:1;
      uint64_t BKPT:1;
      uint64_t DWTTRAP:1;
      uint64_t VCATCH:1;
      uint64_t EXTERNAL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCB_DFSR;

  uint8_t res2[8];

  uint32_t SCB_AFSR;
  uint8_t res3[56];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t Ctype1:3;
      uint64_t Ctype2:3;
      uint64_t Ctype3:3;
      uint64_t Ctype4:3;
      uint64_t Ctype5:3;
      uint64_t Ctype6:3;
      uint64_t Ctype7:3;
      uint64_t LoUIS:3;
      uint64_t LoC:3;
      uint64_t LoUU:3;
      uint64_t ICB:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCB_CLIDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IminLine:4;
      uint64_t reservedSpace0:12;
      uint64_t DminLine:4;
      uint64_t ERG:4;
      uint64_t CWG:4;
      uint64_t reservedSpace1:1;
      uint64_t Format:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCB_CTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LineSize:3;
      uint64_t Associativity:10;
      uint64_t NumSets:15;
      uint64_t WA:1;
      uint64_t RA:1;
      uint64_t WB:1;
      uint64_t WT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCB_CCSIDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t InD:1;
      uint64_t Level:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCB_CSSELR;

};

#define SCB (*(volatile struct SCB_tag *) 0xe000ed00)

struct SysTick_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLE:1;
      uint64_t TICKINT:1;
      uint64_t CLKSOURCE:1;
      uint64_t reservedSpace0:13;
      uint64_t COUNTFLAG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SysTick_SYST_CSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t RELOAD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SysTick_SYST_RVR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t CURRENT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SysTick_SYST_CVR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TENMS:24;
      uint64_t reservedSpace0:6;
      uint64_t SKEW:1;
      uint64_t NOREF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SysTick_SYST_CALIB;

};

#define SysTick (*(volatile struct SysTick_tag *) 0xe000e010)

